## Plan Result (Aks_ptlsbox)




### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 12 to add, 0 to change, 12 to destroy.</code></pre>

* Create
  * azurerm_resource_group.kubernetes_resource_group[&#34;01&#34;]
  * module.kubernetes[&#34;01&#34;].azapi_resource.service_operator_credential
  * module.kubernetes[&#34;01&#34;].azurerm_kubernetes_cluster.kubernetes_cluster
  * module.kubernetes[&#34;01&#34;].azurerm_kubernetes_cluster_node_pool.additional_node_pools[&#34;azurelinux&#34;]
  * module.kubernetes[&#34;01&#34;].azurerm_kubernetes_cluster_node_pool.additional_node_pools[&#34;cronjob&#34;]
  * module.kubernetes[&#34;01&#34;].azurerm_kubernetes_cluster_node_pool.additional_node_pools[&#34;linux&#34;]
  * module.kubernetes[&#34;01&#34;].azurerm_kubernetes_cluster_node_pool.additional_node_pools[&#34;spotinstance&#34;]
  * module.kubernetes[&#34;01&#34;].azurerm_role_assignment.aks_auto_shutdown[0]
  * module.kubernetes[&#34;01&#34;].azurerm_role_assignment.genesis_managed_identity_operator[0]
  * module.kubernetes[&#34;01&#34;].azurerm_role_assignment.global_registry_acrpull[0]
  * module.kubernetes[&#34;01&#34;].azurerm_role_assignment.node_infrastructure_update_scale_set
  * module.kubernetes[&#34;01&#34;].azurerm_role_assignment.update_checker[0]
* Delete
  * azurerm_resource_group.kubernetes_resource_group[&#34;00&#34;]
  * module.kubernetes[&#34;00&#34;].azapi_resource.service_operator_credential
  * module.kubernetes[&#34;00&#34;].azurerm_kubernetes_cluster.kubernetes_cluster
  * module.kubernetes[&#34;00&#34;].azurerm_kubernetes_cluster_node_pool.additional_node_pools[&#34;azurelinux&#34;]
  * module.kubernetes[&#34;00&#34;].azurerm_kubernetes_cluster_node_pool.additional_node_pools[&#34;cronjob&#34;]
  * module.kubernetes[&#34;00&#34;].azurerm_kubernetes_cluster_node_pool.additional_node_pools[&#34;linux&#34;]
  * module.kubernetes[&#34;00&#34;].azurerm_kubernetes_cluster_node_pool.additional_node_pools[&#34;spotinstance&#34;]
  * module.kubernetes[&#34;00&#34;].azurerm_role_assignment.aks_auto_shutdown[0]
  * module.kubernetes[&#34;00&#34;].azurerm_role_assignment.genesis_managed_identity_operator[0]
  * module.kubernetes[&#34;00&#34;].azurerm_role_assignment.global_registry_acrpull[0]
  * module.kubernetes[&#34;00&#34;].azurerm_role_assignment.node_infrastructure_update_scale_set
  * module.kubernetes[&#34;00&#34;].azurerm_role_assignment.update_checker[0]




<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_resource_group.kubernetes_resource_group["00"] will be destroyed
  # (because key ["00"] is not in for_each map)
  - resource "azurerm_resource_group" "kubernetes_resource_group" {
      - id         = "/subscriptions/1497c3d7-ab6d-4bb7-8a10-b51d03189ee3/resourceGroups/cft-ptlsbox-00-rg" -> null
      - location   = "uksouth" -> null
      - name       = "cft-ptlsbox-00-rg" -> null
      - tags       = {
          - "application"  = "core"
          - "autoShutdown" = "true"
          - "builtFrom"    = "hmcts/aks-cft-deploy"
          - "businessArea" = "CFT"
          - "criticality"  = "Low"
          - "environment"  = "sandbox"
          - "expiresAfter" = "3000-01-01"
        } -> null
        # (1 unchanged attribute hidden)
    }

  # azurerm_resource_group.kubernetes_resource_group["01"] will be created
  + resource "azurerm_resource_group" "kubernetes_resource_group" {
      + id       = (known after apply)
      + location = "uksouth"
      + name     = "cft-ptlsbox-01-rg"
      + tags     = {
          + "application"  = "core"
          + "autoShutdown" = "true"
          + "builtFrom"    = "hmcts/aks-cft-deploy"
          + "businessArea" = "CFT"
          + "criticality"  = "Low"
          + "environment"  = "sandbox"
          + "expiresAfter" = "3000-01-01"
        }
    }

  # module.kubernetes["00"].azapi_resource.service_operator_credential will be destroyed
  # (because module.kubernetes["00"] is not in configuration)
  - resource "azapi_resource" "service_operator_credential" {
      - body                      = jsonencode(
            {
              - properties = {
                  - audiences = [
                      - "api://AzureADTokenExchange",
                    ]
                  - issuer    = "https://uksouth.oic.prod-aks.azure.com/531ff96d-0ae9-462a-8d2d-bec7c0b42082/89fe643f-5cb2-4e8c-b3ae-c9f145b8370a/"
                  - subject   = "system:serviceaccount:azureserviceoperator-system:azureserviceoperator-default"
                }
            }
        ) -> null
      - id                        = "/subscriptions/1497c3d7-ab6d-4bb7-8a10-b51d03189ee3/resourceGroups/genesis-rg/providers/Microsoft.ManagedIdentity/userAssignedIdentities/aks-ptlsbox-mi/federatedIdentityCredentials/cft-ptlsbox-00-aks" -> null
      - ignore_casing             = false -> null
      - ignore_missing_property   = true -> null
      - name                      = "cft-ptlsbox-00-aks" -> null
      - output                    = jsonencode({})
      - parent_id                 = "/subscriptions/1497c3d7-ab6d-4bb7-8a10-b51d03189ee3/resourceGroups/genesis-rg/providers/Microsoft.ManagedIdentity/userAssignedIdentities/aks-ptlsbox-mi" -> null
      - schema_validation_enabled = false -> null
      - tags                      = {} -> null
      - type                      = "Microsoft.ManagedIdentity/userAssignedIdentities/federatedIdentityCredentials@2022-01-31-preview" -> null
        # (1 unchanged attribute hidden)
    }

  # module.kubernetes["00"].azurerm_kubernetes_cluster.kubernetes_cluster will be destroyed
  # (because module.kubernetes["00"] is not in configuration)
  - resource "azurerm_kubernetes_cluster" "kubernetes_cluster" {
      - api_server_authorized_ip_ranges     = [] -> null
      - azure_policy_enabled                = false -> null
      - custom_ca_trust_certificates_base64 = [] -> null
      - dns_prefix                          = "k8s-cft-ptlsbox-aks" -> null
      - enable_pod_security_policy          = false -> null
      - fqdn                                = "k8s-cft-ptlsbox-aks-3durt4k8.hcp.uksouth.azmk8s.io" -> null
      - http_application_routing_enabled    = false -> null
      - id                                  = "/subscriptions/1497c3d7-ab6d-4bb7-8a10-b51d03189ee3/resourceGroups/cft-ptlsbox-00-rg/providers/Microsoft.ContainerService/managedClusters/cft-ptlsbox-00-aks" -> null
      - image_cleaner_enabled               = false -> null
      - image_cleaner_interval_hours        = 48 -> null
      - kube_admin_config                   = (sensitive value) -> null
      - kube_admin_config_raw               = (sensitive value) -> null
      - kube_config                         = (sensitive value) -> null
      - kube_config_raw                     = (sensitive value) -> null
      - kubernetes_version                  = "1.29" -> null
      - local_account_disabled              = false -> null
      - location                            = "uksouth" -> null
      - name                                = "cft-ptlsbox-00-aks" -> null
      - node_os_channel_upgrade             = "NodeImage" -> null
      - node_resource_group                 = "cft-ptlsbox-00-aks-node-rg" -> null
      - node_resource_group_id              = "/subscriptions/1497c3d7-ab6d-4bb7-8a10-b51d03189ee3/resourceGroups/cft-ptlsbox-00-aks-node-rg" -> null
      - oidc_issuer_enabled                 = true -> null
      - oidc_issuer_url                     = "https://uksouth.oic.prod-aks.azure.com/531ff96d-0ae9-462a-8d2d-bec7c0b42082/89fe643f-5cb2-4e8c-b3ae-c9f145b8370a/" -> null
      - open_service_mesh_enabled           = false -> null
      - portal_fqdn                         = "k8s-cft-ptlsbox-aks-3durt4k8.portal.hcp.uksouth.azmk8s.io" -> null
      - private_cluster_enabled             = false -> null
      - private_cluster_public_fqdn_enabled = false -> null
      - public_network_access_enabled       = true -> null
      - resource_group_name                 = "cft-ptlsbox-00-rg" -> null
      - role_based_access_control_enabled   = true -> null
      - run_command_enabled                 = true -> null
      - sku_tier                            = "Standard" -> null
      - tags                                = {
          - "application"  = "core"
          - "autoShutdown" = "true"
          - "builtFrom"    = "hmcts/aks-cft-deploy"
          - "businessArea" = "CFT"
          - "criticality"  = "Low"
          - "environment"  = "sandbox"
          - "expiresAfter" = "3000-01-01"
        } -> null
      - workload_identity_enabled           = true -> null
        # (6 unchanged attributes hidden)

      - auto_scaler_profile {
          - balance_similar_node_groups      = false -> null
          - empty_bulk_delete_max            = "10" -> null
          - expander                         = "random" -> null
          - max_graceful_termination_sec     = "600" -> null
          - max_node_provisioning_time       = "15m" -> null
          - max_unready_nodes                = 3 -> null
          - max_unready_percentage           = 45 -> null
          - new_pod_scale_up_delay           = "0s" -> null
          - scale_down_delay_after_add       = "10m" -> null
          - scale_down_delay_after_delete    = "10s" -> null
          - scale_down_delay_after_failure   = "3m" -> null
          - scale_down_unneeded              = "10m" -> null
          - scale_down_unready               = "20m" -> null
          - scale_down_utilization_threshold = "0.5" -> null
          - scan_interval                    = "10s" -> null
          - skip_nodes_with_local_storage    = false -> null
          - skip_nodes_with_system_pods      = true -> null
        }

      - azure_active_directory_role_based_access_control {
          - admin_group_object_ids = [
              - "a6ce5b32-e0a5-419e-ba5c-67863c975941",
              - (sensitive value),
            ] -> null
          - azure_rbac_enabled     = false -> null
          - managed                = true -> null
          - tenant_id              = "531ff96d-0ae9-462a-8d2d-bec7c0b42082" -> null
            # (3 unchanged attributes hidden)
        }

      - default_node_pool {
          - custom_ca_trust_enabled       = false -> null
          - enable_auto_scaling           = true -> null
          - enable_host_encryption        = false -> null
          - enable_node_public_ip         = false -> null
          - fips_enabled                  = false -> null
          - kubelet_disk_type             = "OS" -> null
          - max_count                     = 4 -> null
          - max_pods                      = 30 -> null
          - min_count                     = 2 -> null
          - name                          = "system" -> null
          - node_count                    = 2 -> null
          - node_labels                   = {} -> null
          - node_taints                   = [] -> null
          - only_critical_addons_enabled  = true -> null
          - orchestrator_version          = "1.29" -> null
          - os_disk_size_gb               = 128 -> null
          - os_disk_type                  = "Ephemeral" -> null
          - os_sku                        = "Ubuntu" -> null
          - scale_down_mode               = "Delete" -> null
          - tags                          = {
              - "application"  = "core"
              - "autoShutdown" = "true"
              - "builtFrom"    = "hmcts/aks-cft-deploy"
              - "businessArea" = "CFT"
              - "criticality"  = "Low"
              - "environment"  = "sandbox"
              - "expiresAfter" = "3000-01-01"
            } -> null
          - type                          = "VirtualMachineScaleSets" -> null
          - ultra_ssd_enabled             = false -> null
          - vm_size                       = "Standard_D4ds_v5" -> null
          - vnet_subnet_id                = "/subscriptions/1497c3d7-ab6d-4bb7-8a10-b51d03189ee3/resourceGroups/cft-ptlsbox-network-rg/providers/Microsoft.Network/virtualNetworks/cft-ptlsbox-vnet/subnets/aks-00" -> null
          - zones                         = [] -> null
            # (8 unchanged attributes hidden)

          - upgrade_settings {
              - max_surge = "33%" -> null
            }
        }

      - identity {
          - identity_ids = [
              - "/subscriptions/1497c3d7-ab6d-4bb7-8a10-b51d03189ee3/resourceGroups/genesis-rg/providers/Microsoft.ManagedIdentity/userAssignedIdentities/aks-ptlsbox-mi",
            ] -> null
          - type         = "UserAssigned" -> null
            # (2 unchanged attributes hidden)
        }

      - key_vault_secrets_provider {
          - secret_identity          = [
              - {
                  - client_id                 = "63e16095-6af7-4a3c-9943-25e14997133f"
                  - object_id                 = "ec9f0080-786c-4930-911f-ddf2ba5fd93e"
                  - user_assigned_identity_id = "/subscriptions/1497c3d7-ab6d-4bb7-8a10-b51d03189ee3/resourcegroups/cft-ptlsbox-00-aks-node-rg/providers/Microsoft.ManagedIdentity/userAssignedIdentities/azurekeyvaultsecretsprovider-cft-ptlsbox-00-aks"
                },
            ] -> null
          - secret_rotation_enabled  = true -> null
          - secret_rotation_interval = "5m" -> null
        }

      - kubelet_identity {
          - client_id                 = "593ab129-0b8d-41aa-b9f7-5e4db2807870" -> null
          - object_id                 = "15b684dc-026f-4370-8cf4-c27d0af1033f" -> null
          - user_assigned_identity_id = "/subscriptions/1497c3d7-ab6d-4bb7-8a10-b51d03189ee3/resourceGroups/cft-ptlsbox-00-aks-node-rg/providers/Microsoft.ManagedIdentity/userAssignedIdentities/cft-ptlsbox-00-aks-agentpool" -> null
        }

      - linux_profile {
          - admin_username = "k8sadmin" -> null

          - ssh_key {
              - key_data = "ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABAQDWNmn9m1WkjbXlAWPBeboOjBP9SLc8E6Fsqytdr7pZ3xZ9IwJnzUjYADNuYejCJ0v8KaTF+5THOS0JUIcfmUncE5Kj08o4e/zLxFyNNNfoSePldTMgbbBMd5jTjKB8rBrPif2Oj4e0PjcgEXBVaUvwgoVrh/nkhhzfoydV/DmZ/vpKmJiPrH1plWm8pQheM2g3TrhfIsUXityvPbDBhdCShyLX6I4u10VjZJTXw1DVDVdVYxPKEPUyrYu+qLJGR7M48p0T39nq6bAlxmyQoBdDxgDbZDmfjq2Qyk68xldIlsj/WTXASbY70aO3sV47Qlf7cUEw8ghCWyDCf9Ji2Nbx aks-ssh" -> null
            }
        }

      - maintenance_window_node_os {
          - day_of_month = 0 -> null
          - duration     = 4 -> null
          - frequency    = "Daily" -> null
          - interval     = 1 -> null
          - start_date   = "2024-07-04T00:00:00Z" -> null
          - start_time   = "16:00" -> null
          - utc_offset   = "+00:00" -> null
            # (2 unchanged attributes hidden)
        }

      - network_profile {
          - dns_service_ip      = "10.0.0.10" -> null
          - docker_bridge_cidr  = "172.17.0.1/16" -> null
          - ip_versions         = [
              - "IPv4",
            ] -> null
          - load_balancer_sku   = "standard" -> null
          - network_plugin      = "azure" -> null
          - outbound_type       = "loadBalancer" -> null
          - pod_cidrs           = [] -> null
          - service_cidr        = "10.0.0.0/16" -> null
          - service_cidrs       = [
              - "10.0.0.0/16",
            ] -> null
            # (5 unchanged attributes hidden)

          - load_balancer_profile {
              - effective_outbound_ips      = [
                  - "/subscriptions/1497c3d7-ab6d-4bb7-8a10-b51d03189ee3/resourceGroups/cft-ptlsbox-00-aks-node-rg/providers/Microsoft.Network/publicIPAddresses/c0f0671b-8905-45c5-9602-7ee0b7fb146f",
                ] -> null
              - idle_timeout_in_minutes     = 0 -> null
              - managed_outbound_ip_count   = 1 -> null
              - managed_outbound_ipv6_count = 0 -> null
              - outbound_ip_address_ids     = [] -> null
              - outbound_ip_prefix_ids      = [] -> null
              - outbound_ports_allocated    = 0 -> null
            }
        }

      - windows_profile {
          - admin_username = "azureuser" -> null
            # (2 unchanged attributes hidden)
        }
    }

  # module.kubernetes["00"].azurerm_kubernetes_cluster_node_pool.additional_node_pools["azurelinux"] will be destroyed
  # (because module.kubernetes["00"] is not in configuration)
  - resource "azurerm_kubernetes_cluster_node_pool" "additional_node_pools" {
      - custom_ca_trust_enabled       = false -> null
      - enable_auto_scaling           = true -> null
      - enable_host_encryption        = false -> null
      - enable_node_public_ip         = false -> null
      - fips_enabled                  = false -> null
      - id                            = "/subscriptions/1497c3d7-ab6d-4bb7-8a10-b51d03189ee3/resourceGroups/cft-ptlsbox-00-rg/providers/Microsoft.ContainerService/managedClusters/cft-ptlsbox-00-aks/agentPools/azurelinux" -> null
      - kubelet_disk_type             = "OS" -> null
      - kubernetes_cluster_id         = "/subscriptions/1497c3d7-ab6d-4bb7-8a10-b51d03189ee3/resourceGroups/cft-ptlsbox-00-rg/providers/Microsoft.ContainerService/managedClusters/cft-ptlsbox-00-aks" -> null
      - max_count                     = 1 -> null
      - max_pods                      = 30 -> null
      - min_count                     = 1 -> null
      - mode                          = "User" -> null
      - name                          = "azurelinux" -> null
      - node_count                    = 1 -> null
      - node_labels                   = {} -> null
      - node_taints                   = [
          - "custom.azurelinux=true:NoSchedule",
        ] -> null
      - orchestrator_version          = "1.29" -> null
      - os_disk_size_gb               = 128 -> null
      - os_disk_type                  = "Ephemeral" -> null
      - os_sku                        = "AzureLinux" -> null
      - os_type                       = "Linux" -> null
      - priority                      = "Regular" -> null
      - scale_down_mode               = "Delete" -> null
      - spot_max_price                = -1 -> null
      - tags                          = {
          - "application"  = "core"
          - "autoShutdown" = "true"
          - "builtFrom"    = "hmcts/aks-cft-deploy"
          - "businessArea" = "CFT"
          - "criticality"  = "Low"
          - "environment"  = "sandbox"
          - "expiresAfter" = "3000-01-01"
        } -> null
      - ultra_ssd_enabled             = false -> null
      - vm_size                       = "Standard_DS3_v2" -> null
      - vnet_subnet_id                = "/subscriptions/1497c3d7-ab6d-4bb7-8a10-b51d03189ee3/resourceGroups/cft-ptlsbox-network-rg/providers/Microsoft.Network/virtualNetworks/cft-ptlsbox-vnet/subnets/aks-00" -> null
      - zones                         = [] -> null
        # (7 unchanged attributes hidden)

      - timeouts {
          - update = "180m" -> null
        }

      - upgrade_settings {
          - max_surge = "33%" -> null
        }
    }

  # module.kubernetes["00"].azurerm_kubernetes_cluster_node_pool.additional_node_pools["cronjob"] will be destroyed
  # (because module.kubernetes["00"] is not in configuration)
  - resource "azurerm_kubernetes_cluster_node_pool" "additional_node_pools" {
      - custom_ca_trust_enabled       = false -> null
      - enable_auto_scaling           = true -> null
      - enable_host_encryption        = false -> null
      - enable_node_public_ip         = false -> null
      - fips_enabled                  = false -> null
      - id                            = "/subscriptions/1497c3d7-ab6d-4bb7-8a10-b51d03189ee3/resourceGroups/cft-ptlsbox-00-rg/providers/Microsoft.ContainerService/managedClusters/cft-ptlsbox-00-aks/agentPools/cronjob" -> null
      - kubelet_disk_type             = "OS" -> null
      - kubernetes_cluster_id         = "/subscriptions/1497c3d7-ab6d-4bb7-8a10-b51d03189ee3/resourceGroups/cft-ptlsbox-00-rg/providers/Microsoft.ContainerService/managedClusters/cft-ptlsbox-00-aks" -> null
      - max_count                     = 10 -> null
      - max_pods                      = 30 -> null
      - min_count                     = 0 -> null
      - mode                          = "User" -> null
      - name                          = "cronjob" -> null
      - node_count                    = 1 -> null
      - node_labels                   = {} -> null
      - node_taints                   = [
          - "dedicated=jobs:NoSchedule",
        ] -> null
      - orchestrator_version          = "1.29" -> null
      - os_disk_size_gb               = 128 -> null
      - os_disk_type                  = "Ephemeral" -> null
      - os_sku                        = "Ubuntu" -> null
      - os_type                       = "Linux" -> null
      - priority                      = "Regular" -> null
      - scale_down_mode               = "Delete" -> null
      - spot_max_price                = -1 -> null
      - tags                          = {
          - "application"  = "core"
          - "autoShutdown" = "true"
          - "builtFrom"    = "hmcts/aks-cft-deploy"
          - "businessArea" = "CFT"
          - "criticality"  = "Low"
          - "environment"  = "sandbox"
          - "expiresAfter" = "3000-01-01"
        } -> null
      - ultra_ssd_enabled             = false -> null
      - vm_size                       = "Standard_D4ds_v5" -> null
      - vnet_subnet_id                = "/subscriptions/1497c3d7-ab6d-4bb7-8a10-b51d03189ee3/resourceGroups/cft-ptlsbox-network-rg/providers/Microsoft.Network/virtualNetworks/cft-ptlsbox-vnet/subnets/aks-00" -> null
      - zones                         = [] -> null
        # (7 unchanged attributes hidden)

      - timeouts {
          - update = "180m" -> null
        }

      - upgrade_settings {
          - max_surge = "33%" -> null
        }
    }

  # module.kubernetes["00"].azurerm_kubernetes_cluster_node_pool.additional_node_pools["linux"] will be destroyed
  # (because module.kubernetes["00"] is not in configuration)
  - resource "azurerm_kubernetes_cluster_node_pool" "additional_node_pools" {
      - custom_ca_trust_enabled       = false -> null
      - enable_auto_scaling           = true -> null
      - enable_host_encryption        = false -> null
      - enable_node_public_ip         = false -> null
      - fips_enabled                  = false -> null
      - id                            = "/subscriptions/1497c3d7-ab6d-4bb7-8a10-b51d03189ee3/resourceGroups/cft-ptlsbox-00-rg/providers/Microsoft.ContainerService/managedClusters/cft-ptlsbox-00-aks/agentPools/linux" -> null
      - kubelet_disk_type             = "OS" -> null
      - kubernetes_cluster_id         = "/subscriptions/1497c3d7-ab6d-4bb7-8a10-b51d03189ee3/resourceGroups/cft-ptlsbox-00-rg/providers/Microsoft.ContainerService/managedClusters/cft-ptlsbox-00-aks" -> null
      - max_count                     = 10 -> null
      - max_pods                      = 30 -> null
      - min_count                     = 3 -> null
      - mode                          = "User" -> null
      - name                          = "linux" -> null
      - node_count                    = 4 -> null
      - node_labels                   = {} -> null
      - node_taints                   = [] -> null
      - orchestrator_version          = "1.29" -> null
      - os_disk_size_gb               = 128 -> null
      - os_disk_type                  = "Ephemeral" -> null
      - os_sku                        = "Ubuntu" -> null
      - os_type                       = "Linux" -> null
      - priority                      = "Regular" -> null
      - scale_down_mode               = "Delete" -> null
      - spot_max_price                = -1 -> null
      - tags                          = {
          - "application"  = "core"
          - "autoShutdown" = "true"
          - "builtFrom"    = "hmcts/aks-cft-deploy"
          - "businessArea" = "CFT"
          - "criticality"  = "Low"
          - "environment"  = "sandbox"
          - "expiresAfter" = "3000-01-01"
        } -> null
      - ultra_ssd_enabled             = false -> null
      - vm_size                       = "Standard_D8ds_v5" -> null
      - vnet_subnet_id                = "/subscriptions/1497c3d7-ab6d-4bb7-8a10-b51d03189ee3/resourceGroups/cft-ptlsbox-network-rg/providers/Microsoft.Network/virtualNetworks/cft-ptlsbox-vnet/subnets/aks-00" -> null
      - zones                         = [] -> null
        # (7 unchanged attributes hidden)

      - timeouts {
          - update = "180m" -> null
        }

      - upgrade_settings {
          - max_surge = "33%" -> null
        }
    }

  # module.kubernetes["00"].azurerm_kubernetes_cluster_node_pool.additional_node_pools["spotinstance"] will be destroyed
  # (because module.kubernetes["00"] is not in configuration)
  - resource "azurerm_kubernetes_cluster_node_pool" "additional_node_pools" {
      - custom_ca_trust_enabled       = false -> null
      - enable_auto_scaling           = true -> null
      - enable_host_encryption        = false -> null
      - enable_node_public_ip         = false -> null
      - eviction_policy               = "Delete" -> null
      - fips_enabled                  = false -> null
      - id                            = "/subscriptions/1497c3d7-ab6d-4bb7-8a10-b51d03189ee3/resourceGroups/cft-ptlsbox-00-rg/providers/Microsoft.ContainerService/managedClusters/cft-ptlsbox-00-aks/agentPools/spotinstance" -> null
      - kubelet_disk_type             = "OS" -> null
      - kubernetes_cluster_id         = "/subscriptions/1497c3d7-ab6d-4bb7-8a10-b51d03189ee3/resourceGroups/cft-ptlsbox-00-rg/providers/Microsoft.ContainerService/managedClusters/cft-ptlsbox-00-aks" -> null
      - max_count                     = 5 -> null
      - max_pods                      = 30 -> null
      - min_count                     = 0 -> null
      - mode                          = "User" -> null
      - name                          = "spotinstance" -> null
      - node_count                    = 0 -> null
      - node_labels                   = {
          - "kubernetes.azure.com/scalesetpriority" = "spot"
        } -> null
      - node_taints                   = [
          - "kubernetes.azure.com/scalesetpriority=spot:NoSchedule",
        ] -> null
      - orchestrator_version          = "1.29" -> null
      - os_disk_size_gb               = 128 -> null
      - os_disk_type                  = "Ephemeral" -> null
      - os_sku                        = "Ubuntu" -> null
      - os_type                       = "Linux" -> null
      - priority                      = "Spot" -> null
      - scale_down_mode               = "Delete" -> null
      - spot_max_price                = -1 -> null
      - tags                          = {
          - "application"  = "core"
          - "autoShutdown" = "true"
          - "builtFrom"    = "hmcts/aks-cft-deploy"
          - "businessArea" = "CFT"
          - "criticality"  = "Low"
          - "environment"  = "sandbox"
          - "expiresAfter" = "3000-01-01"
        } -> null
      - ultra_ssd_enabled             = false -> null
      - vm_size                       = "Standard_D4ds_v5" -> null
      - vnet_subnet_id                = "/subscriptions/1497c3d7-ab6d-4bb7-8a10-b51d03189ee3/resourceGroups/cft-ptlsbox-network-rg/providers/Microsoft.Network/virtualNetworks/cft-ptlsbox-vnet/subnets/aks-00" -> null
      - zones                         = [] -> null
        # (6 unchanged attributes hidden)

      - timeouts {
          - update = "180m" -> null
        }
    }

  # module.kubernetes["00"].azurerm_role_assignment.aks_auto_shutdown[0] will be destroyed
  # (because module.kubernetes["00"] is not in configuration)
  - resource "azurerm_role_assignment" "aks_auto_shutdown" {
      - id                                     = "/subscriptions/1497c3d7-ab6d-4bb7-8a10-b51d03189ee3/resourceGroups/cft-ptlsbox-00-rg/providers/Microsoft.ContainerService/managedClusters/cft-ptlsbox-00-aks/providers/Microsoft.Authorization/roleAssignments/4033fca5-ed80-18e8-f9dd-a3543b1aef08" -> null
      - name                                   = "4033fca5-ed80-18e8-f9dd-a3543b1aef08" -> null
      - principal_id                           = "41b2e9c9-db54-40fa-a7c0-a04a5ea7531e" -> null
      - principal_type                         = "ServicePrincipal" -> null
      - role_definition_id                     = "/subscriptions/1497c3d7-ab6d-4bb7-8a10-b51d03189ee3/providers/Microsoft.Authorization/roleDefinitions/b24988ac-6180-42a0-ab88-20f7382dd24c" -> null
      - role_definition_name                   = "Contributor" -> null
      - scope                                  = "/subscriptions/1497c3d7-ab6d-4bb7-8a10-b51d03189ee3/resourceGroups/cft-ptlsbox-00-rg/providers/Microsoft.ContainerService/managedClusters/cft-ptlsbox-00-aks" -> null
        # (4 unchanged attributes hidden)
    }

  # module.kubernetes["00"].azurerm_role_assignment.genesis_managed_identity_operator[0] will be destroyed
  # (because module.kubernetes["00"] is not in configuration)
  - resource "azurerm_role_assignment" "genesis_managed_identity_operator" {
      - id                                     = "/subscriptions/1497c3d7-ab6d-4bb7-8a10-b51d03189ee3/resourceGroups/genesis-rg/providers/Microsoft.ManagedIdentity/userAssignedIdentities/aks-ptlsbox-mi/providers/Microsoft.Authorization/roleAssignments/bec5de20-d4f1-faed-b082-ad057ef261d7" -> null
      - name                                   = "bec5de20-d4f1-faed-b082-ad057ef261d7" -> null
      - principal_id                           = "15b684dc-026f-4370-8cf4-c27d0af1033f" -> null
      - principal_type                         = "ServicePrincipal" -> null
      - role_definition_id                     = "/subscriptions/1497c3d7-ab6d-4bb7-8a10-b51d03189ee3/providers/Microsoft.Authorization/roleDefinitions/f1a07417-d97a-45cb-824c-7a7467783830" -> null
      - role_definition_name                   = "Managed Identity Operator" -> null
      - scope                                  = "/subscriptions/1497c3d7-ab6d-4bb7-8a10-b51d03189ee3/resourceGroups/genesis-rg/providers/Microsoft.ManagedIdentity/userAssignedIdentities/aks-ptlsbox-mi" -> null
        # (4 unchanged attributes hidden)
    }

  # module.kubernetes["00"].azurerm_role_assignment.global_registry_acrpull[0] will be destroyed
  # (because module.kubernetes["00"] is not in configuration)
  - resource "azurerm_role_assignment" "global_registry_acrpull" {
      - id                                     = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/rpe-acr-prod-rg/providers/Microsoft.Authorization/roleAssignments/92c35ad0-df8d-3ea3-e2f9-86540cf3a642" -> null
      - name                                   = "92c35ad0-df8d-3ea3-e2f9-86540cf3a642" -> null
      - principal_id                           = "15b684dc-026f-4370-8cf4-c27d0af1033f" -> null
      - principal_type                         = "ServicePrincipal" -> null
      - role_definition_id                     = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/providers/Microsoft.Authorization/roleDefinitions/7f951dda-4ed3-4680-a7ca-43fe172d538d" -> null
      - role_definition_name                   = "AcrPull" -> null
      - scope                                  = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/rpe-acr-prod-rg" -> null
        # (4 unchanged attributes hidden)
    }

  # module.kubernetes["00"].azurerm_role_assignment.node_infrastructure_update_scale_set will be destroyed
  # (because module.kubernetes["00"] is not in configuration)
  - resource "azurerm_role_assignment" "node_infrastructure_update_scale_set" {
      - id                                     = "/subscriptions/1497c3d7-ab6d-4bb7-8a10-b51d03189ee3/resourceGroups/cft-ptlsbox-00-aks-node-rg/providers/Microsoft.Authorization/roleAssignments/8fe0594f-3b40-1dfd-298f-07d38d08ba5e" -> null
      - name                                   = "8fe0594f-3b40-1dfd-298f-07d38d08ba5e" -> null
      - principal_id                           = "15b684dc-026f-4370-8cf4-c27d0af1033f" -> null
      - principal_type                         = "ServicePrincipal" -> null
      - role_definition_id                     = "/subscriptions/1497c3d7-ab6d-4bb7-8a10-b51d03189ee3/providers/Microsoft.Authorization/roleDefinitions/9980e02c-c2be-4d73-94e8-173b1dc7cf3c" -> null
      - role_definition_name                   = "Virtual Machine Contributor" -> null
      - scope                                  = "/subscriptions/1497c3d7-ab6d-4bb7-8a10-b51d03189ee3/resourceGroups/cft-ptlsbox-00-aks-node-rg" -> null
        # (4 unchanged attributes hidden)
    }

  # module.kubernetes["00"].azurerm_role_assignment.update_checker[0] will be destroyed
  # (because module.kubernetes["00"] is not in configuration)
  - resource "azurerm_role_assignment" "update_checker" {
      - id                                     = "/subscriptions/1497c3d7-ab6d-4bb7-8a10-b51d03189ee3/resourceGroups/cft-ptlsbox-00-rg/providers/Microsoft.ContainerService/managedClusters/cft-ptlsbox-00-aks/providers/Microsoft.Authorization/roleAssignments/9629f292-414e-0ca4-f737-fd3c067117b9" -> null
      - name                                   = "9629f292-414e-0ca4-f737-fd3c067117b9" -> null
      - principal_id                           = "69c0f21d-e37c-41c2-8e16-b6873e941cea" -> null
      - principal_type                         = "ServicePrincipal" -> null
      - role_definition_id                     = "/subscriptions/1497c3d7-ab6d-4bb7-8a10-b51d03189ee3/providers/Microsoft.Authorization/roleDefinitions/b24988ac-6180-42a0-ab88-20f7382dd24c" -> null
      - role_definition_name                   = "Contributor" -> null
      - scope                                  = "/subscriptions/1497c3d7-ab6d-4bb7-8a10-b51d03189ee3/resourceGroups/cft-ptlsbox-00-rg/providers/Microsoft.ContainerService/managedClusters/cft-ptlsbox-00-aks" -> null
        # (4 unchanged attributes hidden)
    }

  # module.kubernetes["01"].azapi_resource.service_operator_credential will be created
  + resource "azapi_resource" "service_operator_credential" {
      + body                      = (known after apply)
      + id                        = (known after apply)
      + ignore_casing             = false
      + ignore_missing_property   = true
      + location                  = "uksouth"
      + name                      = "cft-ptlsbox-01-aks"
      + output                    = (known after apply)
      + parent_id                 = "/subscriptions/1497c3d7-ab6d-4bb7-8a10-b51d03189ee3/resourceGroups/genesis-rg/providers/Microsoft.ManagedIdentity/userAssignedIdentities/aks-ptlsbox-mi"
      + schema_validation_enabled = false
      + tags                      = (known after apply)
      + type                      = "Microsoft.ManagedIdentity/userAssignedIdentities/federatedIdentityCredentials@2022-01-31-preview"

      + identity (known after apply)
    }

  # module.kubernetes["01"].azurerm_kubernetes_cluster.kubernetes_cluster will be created
  + resource "azurerm_kubernetes_cluster" "kubernetes_cluster" {
      + api_server_authorized_ip_ranges     = (known after apply)
      + azure_policy_enabled                = false
      + dns_prefix                          = "k8s-cft-ptlsbox-aks"
      + fqdn                                = (known after apply)
      + http_application_routing_zone_name  = (known after apply)
      + id                                  = (known after apply)
      + image_cleaner_enabled               = false
      + image_cleaner_interval_hours        = 48
      + kube_admin_config                   = (sensitive value)
      + kube_admin_config_raw               = (sensitive value)
      + kube_config                         = (sensitive value)
      + kube_config_raw                     = (sensitive value)
      + kubernetes_version                  = "1.25"
      + location                            = "uksouth"
      + name                                = "cft-ptlsbox-01-aks"
      + node_os_channel_upgrade             = "NodeImage"
      + node_resource_group                 = "cft-ptlsbox-01-aks-node-rg"
      + node_resource_group_id              = (known after apply)
      + oidc_issuer_enabled                 = true
      + oidc_issuer_url                     = (known after apply)
      + portal_fqdn                         = (known after apply)
      + private_cluster_enabled             = false
      + private_cluster_public_fqdn_enabled = false
      + private_dns_zone_id                 = (known after apply)
      + private_fqdn                        = (known after apply)
      + public_network_access_enabled       = true
      + resource_group_name                 = "cft-ptlsbox-01-rg"
      + role_based_access_control_enabled   = true
      + run_command_enabled                 = true
      + sku_tier                            = "Standard"
      + tags                                = {
          + "application"  = "core"
          + "autoShutdown" = "true"
          + "builtFrom"    = "hmcts/aks-cft-deploy"
          + "businessArea" = "CFT"
          + "criticality"  = "Low"
          + "environment"  = "sandbox"
          + "expiresAfter" = "3000-01-01"
        }
      + workload_identity_enabled           = true

      + api_server_access_profile (known after apply)

      + auto_scaler_profile (known after apply)

      + azure_active_directory_role_based_access_control {
          + admin_group_object_ids = [
              + "a6ce5b32-e0a5-419e-ba5c-67863c975941",
              + (sensitive value),
            ]
          + azure_rbac_enabled     = false
          + managed                = true
          + tenant_id              = (known after apply)
        }

      + default_node_pool {
          + enable_auto_scaling          = true
          + kubelet_disk_type            = (known after apply)
          + max_count                    = 4
          + max_pods                     = 30
          + min_count                    = 2
          + name                         = "system"
          + node_count                   = (known after apply)
          + node_labels                  = (known after apply)
          + only_critical_addons_enabled = true
          + orchestrator_version         = "1.25"
          + os_disk_size_gb              = 128
          + os_disk_type                 = "Ephemeral"
          + os_sku                       = (known after apply)
          + scale_down_mode              = "Delete"
          + tags                         = {
              + "application"  = "core"
              + "autoShutdown" = "true"
              + "builtFrom"    = "hmcts/aks-cft-deploy"
              + "businessArea" = "CFT"
              + "criticality"  = "Low"
              + "environment"  = "sandbox"
              + "expiresAfter" = "3000-01-01"
            }
          + type                         = "VirtualMachineScaleSets"
          + ultra_ssd_enabled            = false
          + vm_size                      = "Standard_D4ds_v5"
          + vnet_subnet_id               = "/subscriptions/1497c3d7-ab6d-4bb7-8a10-b51d03189ee3/resourceGroups/cft-ptlsbox-network-rg/providers/Microsoft.Network/virtualNetworks/cft-ptlsbox-vnet/subnets/aks-01"
          + workload_runtime             = (known after apply)

          + upgrade_settings {
              + max_surge = "33%"
            }
        }

      + identity {
          + identity_ids = [
              + "/subscriptions/1497c3d7-ab6d-4bb7-8a10-b51d03189ee3/resourceGroups/genesis-rg/providers/Microsoft.ManagedIdentity/userAssignedIdentities/aks-ptlsbox-mi",
            ]
          + principal_id = (known after apply)
          + tenant_id    = (known after apply)
          + type         = "UserAssigned"
        }

      + key_vault_secrets_provider {
          + secret_identity          = (known after apply)
          + secret_rotation_enabled  = true
          + secret_rotation_interval = "5m"
        }

      + kubelet_identity (known after apply)

      + linux_profile {
          + admin_username = "k8sadmin"

          + ssh_key {
              + key_data = "ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABAQDWNmn9m1WkjbXlAWPBeboOjBP9SLc8E6Fsqytdr7pZ3xZ9IwJnzUjYADNuYejCJ0v8KaTF+5THOS0JUIcfmUncE5Kj08o4e/zLxFyNNNfoSePldTMgbbBMd5jTjKB8rBrPif2Oj4e0PjcgEXBVaUvwgoVrh/nkhhzfoydV/DmZ/vpKmJiPrH1plWm8pQheM2g3TrhfIsUXityvPbDBhdCShyLX6I4u10VjZJTXw1DVDVdVYxPKEPUyrYu+qLJGR7M48p0T39nq6bAlxmyQoBdDxgDbZDmfjq2Qyk68xldIlsj/WTXASbY70aO3sV47Qlf7cUEw8ghCWyDCf9Ji2Nbx aks-ssh"
            }
        }

      + maintenance_window_node_os {
          + duration   = 4
          + frequency  = "Daily"
          + interval   = 1
          + start_date = (known after apply)
          + start_time = "16:00"
          + utc_offset = "+00:00"
        }

      + network_profile {
          + dns_service_ip     = (known after apply)
          + docker_bridge_cidr = (known after apply)
          + ip_versions        = (known after apply)
          + load_balancer_sku  = "standard"
          + network_mode       = (known after apply)
          + network_plugin     = "azure"
          + network_policy     = (known after apply)
          + outbound_type      = "loadBalancer"
          + pod_cidr           = (known after apply)
          + pod_cidrs          = (known after apply)
          + service_cidr       = (known after apply)
          + service_cidrs      = (known after apply)

          + load_balancer_profile (known after apply)

          + nat_gateway_profile (known after apply)
        }

      + windows_profile (known after apply)
    }

  # module.kubernetes["01"].azurerm_kubernetes_cluster_node_pool.additional_node_pools["azurelinux"] will be created
  + resource "azurerm_kubernetes_cluster_node_pool" "additional_node_pools" {
      + enable_auto_scaling   = true
      + id                    = (known after apply)
      + kubelet_disk_type     = (known after apply)
      + kubernetes_cluster_id = (known after apply)
      + max_count             = 1
      + max_pods              = 30
      + min_count             = 1
      + mode                  = "User"
      + name                  = "azurelinux"
      + node_count            = (known after apply)
      + node_labels           = (known after apply)
      + node_taints           = [
          + "custom.azurelinux=true:NoSchedule",
        ]
      + orchestrator_version  = "1.25"
      + os_disk_size_gb       = (known after apply)
      + os_disk_type          = "Ephemeral"
      + os_sku                = "AzureLinux"
      + os_type               = "Linux"
      + priority              = "Regular"
      + scale_down_mode       = "Delete"
      + spot_max_price        = -1
      + tags                  = {
          + "application"  = "core"
          + "autoShutdown" = "true"
          + "builtFrom"    = "hmcts/aks-cft-deploy"
          + "businessArea" = "CFT"
          + "criticality"  = "Low"
          + "environment"  = "sandbox"
          + "expiresAfter" = "3000-01-01"
        }
      + ultra_ssd_enabled     = false
      + vm_size               = "Standard_DS3_v2"
      + vnet_subnet_id        = "/subscriptions/1497c3d7-ab6d-4bb7-8a10-b51d03189ee3/resourceGroups/cft-ptlsbox-network-rg/providers/Microsoft.Network/virtualNetworks/cft-ptlsbox-vnet/subnets/aks-01"

      + timeouts {
          + update = "180m"
        }

      + upgrade_settings {
          + max_surge = "33%"
        }
    }

  # module.kubernetes["01"].azurerm_kubernetes_cluster_node_pool.additional_node_pools["cronjob"] will be created
  + resource "azurerm_kubernetes_cluster_node_pool" "additional_node_pools" {
      + enable_auto_scaling   = true
      + id                    = (known after apply)
      + kubelet_disk_type     = (known after apply)
      + kubernetes_cluster_id = (known after apply)
      + max_count             = 10
      + max_pods              = 30
      + min_count             = 0
      + mode                  = "User"
      + name                  = "cronjob"
      + node_count            = (known after apply)
      + node_labels           = (known after apply)
      + node_taints           = [
          + "dedicated=jobs:NoSchedule",
        ]
      + orchestrator_version  = "1.25"
      + os_disk_size_gb       = (known after apply)
      + os_disk_type          = "Ephemeral"
      + os_sku                = (known after apply)
      + os_type               = "Linux"
      + priority              = "Regular"
      + scale_down_mode       = "Delete"
      + spot_max_price        = -1
      + tags                  = {
          + "application"  = "core"
          + "autoShutdown" = "true"
          + "builtFrom"    = "hmcts/aks-cft-deploy"
          + "businessArea" = "CFT"
          + "criticality"  = "Low"
          + "environment"  = "sandbox"
          + "expiresAfter" = "3000-01-01"
        }
      + ultra_ssd_enabled     = false
      + vm_size               = "Standard_D4ds_v5"
      + vnet_subnet_id        = "/subscriptions/1497c3d7-ab6d-4bb7-8a10-b51d03189ee3/resourceGroups/cft-ptlsbox-network-rg/providers/Microsoft.Network/virtualNetworks/cft-ptlsbox-vnet/subnets/aks-01"

      + timeouts {
          + update = "180m"
        }

      + upgrade_settings {
          + max_surge = "33%"
        }
    }

  # module.kubernetes["01"].azurerm_kubernetes_cluster_node_pool.additional_node_pools["linux"] will be created
  + resource "azurerm_kubernetes_cluster_node_pool" "additional_node_pools" {
      + enable_auto_scaling   = true
      + id                    = (known after apply)
      + kubelet_disk_type     = (known after apply)
      + kubernetes_cluster_id = (known after apply)
      + max_count             = 10
      + max_pods              = 30
      + min_count             = 3
      + mode                  = "User"
      + name                  = "linux"
      + node_count            = (known after apply)
      + node_labels           = (known after apply)
      + node_taints           = []
      + orchestrator_version  = "1.25"
      + os_disk_size_gb       = (known after apply)
      + os_disk_type          = "Ephemeral"
      + os_sku                = (known after apply)
      + os_type               = "Linux"
      + priority              = "Regular"
      + scale_down_mode       = "Delete"
      + spot_max_price        = -1
      + tags                  = {
          + "application"  = "core"
          + "autoShutdown" = "true"
          + "builtFrom"    = "hmcts/aks-cft-deploy"
          + "businessArea" = "CFT"
          + "criticality"  = "Low"
          + "environment"  = "sandbox"
          + "expiresAfter" = "3000-01-01"
        }
      + ultra_ssd_enabled     = false
      + vm_size               = "Standard_D8ds_v5"
      + vnet_subnet_id        = "/subscriptions/1497c3d7-ab6d-4bb7-8a10-b51d03189ee3/resourceGroups/cft-ptlsbox-network-rg/providers/Microsoft.Network/virtualNetworks/cft-ptlsbox-vnet/subnets/aks-01"

      + timeouts {
          + update = "180m"
        }

      + upgrade_settings {
          + max_surge = "33%"
        }
    }

  # module.kubernetes["01"].azurerm_kubernetes_cluster_node_pool.additional_node_pools["spotinstance"] will be created
  + resource "azurerm_kubernetes_cluster_node_pool" "additional_node_pools" {
      + enable_auto_scaling   = true
      + eviction_policy       = "Delete"
      + id                    = (known after apply)
      + kubelet_disk_type     = (known after apply)
      + kubernetes_cluster_id = (known after apply)
      + max_count             = 5
      + max_pods              = 30
      + min_count             = 0
      + mode                  = "User"
      + name                  = "spotinstance"
      + node_count            = (known after apply)
      + node_labels           = (known after apply)
      + node_taints           = [
          + "kubernetes.azure.com/scalesetpriority=spot:NoSchedule",
        ]
      + orchestrator_version  = "1.25"
      + os_disk_size_gb       = (known after apply)
      + os_disk_type          = "Ephemeral"
      + os_sku                = (known after apply)
      + os_type               = "Linux"
      + priority              = "Spot"
      + scale_down_mode       = "Delete"
      + spot_max_price        = -1
      + tags                  = {
          + "application"  = "core"
          + "autoShutdown" = "true"
          + "builtFrom"    = "hmcts/aks-cft-deploy"
          + "businessArea" = "CFT"
          + "criticality"  = "Low"
          + "environment"  = "sandbox"
          + "expiresAfter" = "3000-01-01"
        }
      + ultra_ssd_enabled     = false
      + vm_size               = "Standard_D4ds_v5"
      + vnet_subnet_id        = "/subscriptions/1497c3d7-ab6d-4bb7-8a10-b51d03189ee3/resourceGroups/cft-ptlsbox-network-rg/providers/Microsoft.Network/virtualNetworks/cft-ptlsbox-vnet/subnets/aks-01"

      + timeouts {
          + update = "180m"
        }
    }

  # module.kubernetes["01"].azurerm_role_assignment.aks_auto_shutdown[0] will be created
  + resource "azurerm_role_assignment" "aks_auto_shutdown" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "41b2e9c9-db54-40fa-a7c0-a04a5ea7531e"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Contributor"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.kubernetes["01"].azurerm_role_assignment.genesis_managed_identity_operator[0] will be created
  + resource "azurerm_role_assignment" "genesis_managed_identity_operator" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Managed Identity Operator"
      + scope                            = "/subscriptions/1497c3d7-ab6d-4bb7-8a10-b51d03189ee3/resourceGroups/genesis-rg/providers/Microsoft.ManagedIdentity/userAssignedIdentities/aks-ptlsbox-mi"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.kubernetes["01"].azurerm_role_assignment.global_registry_acrpull[0] will be created
  + resource "azurerm_role_assignment" "global_registry_acrpull" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "AcrPull"
      + scope                            = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/rpe-acr-prod-rg"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.kubernetes["01"].azurerm_role_assignment.node_infrastructure_update_scale_set will be created
  + resource "azurerm_role_assignment" "node_infrastructure_update_scale_set" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Virtual Machine Contributor"
      + scope                            = "/subscriptions/1497c3d7-ab6d-4bb7-8a10-b51d03189ee3/resourceGroups/cft-ptlsbox-01-aks-node-rg"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.kubernetes["01"].azurerm_role_assignment.update_checker[0] will be created
  + resource "azurerm_role_assignment" "update_checker" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "69c0f21d-e37c-41c2-8e16-b6873e941cea"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Contributor"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

Plan: 12 to add, 0 to change, 12 to destroy.

Changes to Outputs:
  ~ clusters           = "00" -> "01"
  ~ kubelet_object_ids = "15b684dc-026f-4370-8cf4-c27d0af1033f" -> (known after apply)
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":659,"Program":"tfcmt","SHA1":"","Target":"Aks_ptlsbox","Vars":{}} -->